# LevelRoomComputationHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LevelRoomComputationHeight Property
ParameterTypeId Class See Also
---
"Computation Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LevelRoomComputationHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LevelRoomComputationHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LevelRoomComputationHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace